// let name = prompt('Ім\'я твоє як?')
// let age = prompt('Чи готовий ти? Маєш років скільки?')
// let message
// if(age >= 18){
// 	message = `<p class="text">Падаван ${name}, бути джедаєм - значить дивитись правді в очі і вибирати.
// 	Випромінювати світло чи темряву. Будь свічкою або ніччю.</p>`
// }
// else{
// 	message = `<p class="text">Падаван ${name}, Істинно прекрасним розум дитини є! Не вистачає ${(18-age)/18*100}, рости тобі ще.</p>`
// }

// document.body.innerHTML = message

const LABEL_NAME = [
    "Як звати тебе?", 
    "Тебе то як звати?", 
    "Ім'я твоє яке, юний падаван?",
    "Хто ти такий, малий?",
    "Як назвали тебе батьки твої?",
    "Ім'я твоє, скажи мені, юний учню Сили?"];

const LABEL_AGE = [
    "Готовий чи ти, юний падаване? І скільки літ минуло з твого народження?",
    "Готовий до випробувань? Скільки циклів обернулося навколо сонця з часу твого появлення?",
    "Готовий чи ти до шляху? Скільки років просипалося через пісочний годинник твого життя?",
    "Чи готовий ти до завдання? Скільки зим і літ бачив ти?" ,
    "Чи готовий ти до випробувань? Скільки років згасло з часу твого народження?",
    "Чи готовий ти до подорожі? Скільки зустріло твоє око років з моменту зявлення?",
    "Чи готовий ти до бою? Скільки років бачив ти на небі?",
    "Чи готовий ти до знань? Скільки років прочикав ти?",
    "Чи готовий ти до відповідальності? Скільки років прийняв ти самостійно?",    
    'Чи готовий ти? Маєш років скільки?'];

let random_label_name = Math.floor(Math.random() * LABEL_NAME.length);
let user_name = prompt(LABEL_NAME[random_label_name]);
user_name = '<span>' + user_name + '</span>'

const MESSAGE_TRUE = [
    "Падаване " + user_name + ", Сила сильна в тобі, але вибір - твій. Світло чи темрява, шлях ти обираєш сам.",
    "Бачиш ти, " + user_name + " падаване, все має дві сторони. Світло й тінь, життя і смерть. Вибирай мудро.",
    "Світло - шлях воїна джедая, темрява спокушає силою. Який шлях обираєш ти, " + user_name + " юний учню?",
    "Бути джедаєм - значить служити іншим, а не собі. Чи готовий " + user_name + " ти віддати все заради добра?",
    "Падаван " + user_name + ", бути джедаєм - значить дивитись правді в очі і вибирати. Випромінювати світло чи темряву. Будь свічкою або ніччю."
];

let random_label_age = Math.floor(Math.random() * LABEL_AGE.length);
let user_age = prompt(LABEL_AGE[random_label_age]);

const MESSAGE_FALSE = [
    "Падаван " + user_name + ", Істинно прекрасним розум дитини є! Не вистачає " + user_age + " років, рости тобі ще.",
    'О, ' + user_name + ", падаване, розум твій сяє, як зірка ясна. Але шлях " + user_age + " років довгий попереду, вчитися ще багато треба тобі.",
    "Мозок твій, юний учню " + user_name + ", гострий як меч. Але мудрість приходить з досвідом " + user_age + "років, а не лише з розумом.",
    "Далеко зайшов ти, " + user_name + ", але вершини ще не досяг. Терпіння та наполегливість " + user_age + " років - ось ключ до успіху.",
    "Світло розуму твого сяє, юний падаване. Але, ще " + user_age + " років " + user_name + " Сила не тільки в знаннях, а й у серці."
];

let message = '';

if (isNaN(user_age)) { // Not-a-Number
    message = '';
    // Рахувти ти не вмієш, далеко тобі до сили Джедая.
    // Що за нерозумне, математики тут не знаєш, не бачити тобі сили.
    // О..оо, ти зявився чого сюди, науки іди вчитися людської. Цифри зрозумій!.
} else {
    message = '';
}

let jedi = document.getElementById('jedi');
jedi.innerHTML = message;
